// Copyright (c) 2022 Via Technology Ltd.
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

//! FFI bindings for [cl_ext.h](https://github.com/KhronosGroup/OpenCL-Headers/blob/main/CL/cl_ext.h)  
//! cl_ext.h contains OpenCL extensions that don't have external (OpenGL, D3D) dependencies.  
//! OpenCL extensions are documented in the [OpenCL-Registry](https://github.com/KhronosGroup/OpenCL-Registry)

#![allow(non_camel_case_types, non_upper_case_globals)]

pub use super::cl::{
    cl_bitfield, cl_bool, cl_channel_type, cl_command_queue, cl_command_queue_properties,
    cl_command_type, cl_context, cl_device_id, cl_device_info, cl_event, cl_event_info,
    cl_image_desc, cl_image_format, cl_kernel, cl_kernel_exec_info, cl_kernel_info,
    cl_kernel_sub_group_info, cl_map_flags, cl_mem, cl_mem_flags, cl_mem_info,
    cl_mem_migration_flags, cl_mem_properties, cl_platform_id, cl_platform_info, cl_program,

pub const CL_QUEUE_CAPABILITY_TRANSFER_IMAGE_INTEL: cl_command_queue_capabilities_intel = 1 << 12;
pub const CL_QUEUE_CAPABILITY_MAP_IMAGE_INTEL: cl_command_queue_capabilities_intel = 1 << 13;
pub const CL_QUEUE_CAPABILITY_FILL_IMAGE_INTEL: cl_command_queue_capabilities_intel = 1 << 14;
pub const CL_QUEUE_CAPABILITY_TRANSFER_BUFFER_IMAGE_INTEL: cl_command_queue_capabilities_intel =
    1 << 15;
pub const CL_QUEUE_CAPABILITY_TRANSFER_IMAGE_BUFFER_INTEL: cl_command_queue_capabilities_intel =
    1 << 16;
pub const CL_QUEUE_CAPABILITY_MARKER_INTEL: cl_command_queue_capabilities_intel = 1 << 24;
pub const CL_QUEUE_CAPABILITY_BARRIER_INTEL: cl_command_queue_capabilities_intel = 1 << 25;
pub const CL_QUEUE_CAPABILITY_KERNEL_INTEL: cl_command_queue_capabilities_intel = 1 << 26;

// cl_intel_queue_no_sync_operations
pub const CL_QUEUE_NO_SYNC_OPERATIONS_INTEL: cl_command_queue_properties = 1 << 29;

// cl_ext_image_requirements_info

pub type cl_image_requirements_info_ext = cl_uint;

pub const CL_IMAGE_REQUIREMENTS_ROW_PITCH_ALIGNMENT_EXT: cl_image_requirements_info_ext = 0x1290;
pub const CL_IMAGE_REQUIREMENTS_BASE_ADDRESS_ALIGNMENT_EXT: cl_image_requirements_info_ext = 0x1292;
pub const CL_IMAGE_REQUIREMENTS_SIZE_EXT: cl_image_requirements_info_ext = 0x12B2;
pub const CL_IMAGE_REQUIREMENTS_MAX_WIDTH_EXT: cl_image_requirements_info_ext = 0x12B3;
pub const CL_IMAGE_REQUIREMENTS_MAX_HEIGHT_EXT: cl_image_requirements_info_ext = 0x12B4;
pub const CL_IMAGE_REQUIREMENTS_MAX_DEPTH_EXT: cl_image_requirements_info_ext = 0x12B5;
pub const CL_IMAGE_REQUIREMENTS_MAX_ARRAY_SIZE_EXT: cl_image_requirements_info_ext = 0x12B6;

#[cfg_attr(not(target_os = "macos"), link(name = "OpenCL"))]
#[cfg_attr(target_os = "macos", link(name = "OpenCL", kind = "framework"))]
#[cfg(feature = "cl_ext_image_requirements_info")]
extern "system" {

    pub fn clGetImageRequirementsInfoEXT(
        context: cl_context,
        properties: *const cl_mem_properties,
        flags: cl_mem_flags,
        image_format: *const cl_image_format,
        image_desc: *const cl_image_desc,
        param_name: cl_image_requirements_info_ext,
        param_value_size: size_t,
        param_value: *mut c_void,
        param_value_size_ret: *mut size_t,
    ) -> cl_int;
}

pub type clGetImageRequirementsInfoEXT_fn = Option<
    unsafe extern "C" fn(
        context: cl_context,
        properties: *const cl_mem_properties,
        flags: cl_mem_flags,
        image_format: *const cl_image_format,
        image_desc: *const cl_image_desc,
        param_name: cl_image_requirements_info_ext,
        param_value_size: size_t,
        param_value: *mut c_void,
        param_value_size_ret: *mut size_t,
    ) -> cl_int,
>;

// cl_ext_image_from_buffer

pub const CL_IMAGE_REQUIREMENTS_SLICE_PITCH_ALIGNMENT_EXT: cl_image_requirements_info_ext = 0x1291;

#[cfg(test)]
mod tests {
    use super::*;

    #[test]
    #[allow(deref_nullptr)]
    fn bindgen_test_layout_cl_mem_ext_host_ptr() {
        assert_eq!(
            ::std::mem::size_of::<cl_mem_ext_host_ptr>(),
            8usize,
            concat!("Size of: ", stringify!(cl_mem_ext_host_ptr))
        );
        assert_eq!(
            ::std::mem::align_of::<cl_mem_ext_host_ptr>(),
            4usize,
            concat!("Alignment of ", stringify!(cl_mem_ext_host_ptr))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_mem_ext_host_ptr>())).allocation_type as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_mem_ext_host_ptr),
                "::",
                stringify!(allocation_type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_mem_ext_host_ptr>())).host_cache_policy as *const _
                    as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_mem_ext_host_ptr),
                "::",
                stringify!(host_cache_policy)
            )
        );
    }

    #[test]
    #[allow(deref_nullptr)]
    fn bindgen_test_layout_cl_mem_ion_host_ptr() {
        assert_eq!(
            ::std::mem::size_of::<cl_mem_ion_host_ptr>(),
            24usize,
            concat!("Size of: ", stringify!(cl_mem_ion_host_ptr))
        );
        assert_eq!(
            ::std::mem::align_of::<cl_mem_ion_host_ptr>(),
            8usize,
            concat!("Alignment of ", stringify!(cl_mem_ion_host_ptr))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_mem_ion_host_ptr>())).ext_host_ptr as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_mem_ion_host_ptr),
                "::",
                stringify!(ext_host_ptr)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_mem_ion_host_ptr>())).ion_filedesc as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_mem_ion_host_ptr),
                "::",
                stringify!(ion_filedesc)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_mem_ion_host_ptr>())).ion_hostptr as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_mem_ion_host_ptr),
                "::",
                stringify!(ion_hostptr)
            )
        );
    }

    #[test]
    #[allow(deref_nullptr)]
    fn bindgen_test_layout_cl_mem_android_native_buffer_host_ptr() {
        assert_eq!(
            ::std::mem::size_of::<cl_mem_android_native_buffer_host_ptr>(),
            16usize,
            concat!(
                "Size of: ",
                stringify!(cl_mem_android_native_buffer_host_ptr)
            )
        );
        assert_eq!(
            ::std::mem::align_of::<cl_mem_android_native_buffer_host_ptr>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(cl_mem_android_native_buffer_host_ptr)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_mem_android_native_buffer_host_ptr>())).ext_host_ptr
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_mem_android_native_buffer_host_ptr),
                "::",
                stringify!(ext_host_ptr)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_mem_android_native_buffer_host_ptr>())).anb_ptr
                    as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_mem_android_native_buffer_host_ptr),
                "::",
                stringify!(anb_ptr)
            )
        );
    }

    #[test]
    #[allow(deref_nullptr)]
    fn bindgen_test_layout_cl_name_version_khr() {
        assert_eq!(
            ::std::mem::size_of::<cl_name_version_khr>(),
            68usize,
            concat!("Size of: ", stringify!(cl_name_version_khr))
        );
        assert_eq!(
            ::std::mem::align_of::<cl_name_version_khr>(),
            4usize,
            concat!("Alignment of ", stringify!(cl_name_version_khr))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<cl_name_version_khr>())).version as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_name_version_khr),
                "::",
                stringify!(version)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<cl_name_version_khr>())).name as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_name_version_khr),
                "::",
                stringify!(name)
            )
        );
    }

    #[test]
    #[allow(deref_nullptr)]
    fn bindgen_test_layout_cl_device_pci_bus_info_khr() {
        assert_eq!(
            ::std::mem::size_of::<cl_device_pci_bus_info_khr>(),
            16usize,
            concat!("Size of: ", stringify!(cl_device_pci_bus_info_khr))
        );
        assert_eq!(
            ::std::mem::align_of::<cl_device_pci_bus_info_khr>(),
            4usize,
            concat!("Alignment of ", stringify!(cl_device_pci_bus_info_khr))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_pci_bus_info_khr>())).pci_domain as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_pci_bus_info_khr),
                "::",
                stringify!(pci_domain)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_pci_bus_info_khr>())).pci_bus as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_pci_bus_info_khr),
                "::",
                stringify!(pci_bus)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_pci_bus_info_khr>())).pci_device as *const _
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_pci_bus_info_khr),
                "::",
                stringify!(pci_device)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_pci_bus_info_khr>())).pci_function as *const _
                    as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_pci_bus_info_khr),
                "::",
                stringify!(pci_function)
            )
        );
    }

    #[test]
    #[allow(deref_nullptr)]
    fn bindgen_test_layout_cl_device_integer_dot_product_acceleration_properties_khr() {
        assert_eq!(
            ::std::mem::size_of::<cl_device_integer_dot_product_acceleration_properties_khr>(),
            24usize,
            concat!(
                "Size of: ",
                stringify!(cl_device_integer_dot_product_acceleration_properties_khr)
            )
        );
        assert_eq!(
            ::std::mem::align_of::<cl_device_integer_dot_product_acceleration_properties_khr>(),
            4usize,
            concat!(
                "Alignment of ",
                stringify!(cl_device_integer_dot_product_acceleration_properties_khr)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_integer_dot_product_acceleration_properties_khr>(
                )))
                .signed_accelerated as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_integer_dot_product_acceleration_properties_khr),
                "::",
                stringify!(signed_accelerated)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_integer_dot_product_acceleration_properties_khr>(
                )))
                .unsigned_accelerated as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_integer_dot_product_acceleration_properties_khr),
                "::",
                stringify!(unsigned_accelerated)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_integer_dot_product_acceleration_properties_khr>(
                )))
                .mixed_signedness_accelerated as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_integer_dot_product_acceleration_properties_khr),
                "::",
                stringify!(mixed_signedness_accelerated)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_integer_dot_product_acceleration_properties_khr>(
                )))
                .accumulating_saturating_signed_accelerated as *const _ as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_integer_dot_product_acceleration_properties_khr),
                "::",
                stringify!(accumulating_saturating_signed_accelerated)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_integer_dot_product_acceleration_properties_khr>(
                )))
                .accumulating_saturating_unsigned_accelerated as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_integer_dot_product_acceleration_properties_khr),
                "::",
                stringify!(accumulating_saturating_unsigned_accelerated)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_device_integer_dot_product_acceleration_properties_khr>(
                )))
                .accumulating_saturating_mixed_signedness_accelerated as *const _
                    as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_device_integer_dot_product_acceleration_properties_khr),
                "::",
                stringify!(accumulating_saturating_mixed_signedness_accelerated)
            )
        );
    }

    #[test]
    #[allow(deref_nullptr)]
    fn bindgen_test_layout_cl_motion_estimation_desc_intel() {
        assert_eq!(
            ::std::mem::size_of::<cl_motion_estimation_desc_intel>(),
            16usize,
            concat!("Size of: ", stringify!(cl_motion_estimation_desc_intel))
        );
        assert_eq!(
            ::std::mem::align_of::<cl_motion_estimation_desc_intel>(),
            4usize,
            concat!("Alignment of ", stringify!(cl_motion_estimation_desc_intel))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_motion_estimation_desc_intel>())).mb_block_type
                    as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_motion_estimation_desc_intel),
                "::",
                stringify!(mb_block_type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_motion_estimation_desc_intel>())).subpixel_mode
                    as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_motion_estimation_desc_intel),
                "::",
                stringify!(subpixel_mode)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_motion_estimation_desc_intel>())).sad_adjust_mode
                    as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_motion_estimation_desc_intel),
                "::",
                stringify!(sad_adjust_mode)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_motion_estimation_desc_intel>())).search_path_type
                    as *const _ as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_motion_estimation_desc_intel),
                "::",
                stringify!(search_path_type)
            )
        );
    }

    #[test]
    #[allow(deref_nullptr)]
    fn bindgen_test_layout_cl_queue_family_properties_intel() {
        assert_eq!(
            ::std::mem::size_of::<cl_queue_family_properties_intel>(),
            88usize,
            concat!("Size of: ", stringify!(cl_queue_family_properties_intel))
        );
        assert_eq!(
            ::std::mem::align_of::<cl_queue_family_properties_intel>(),
            8usize,
            concat!(
                "Alignment of ",
                stringify!(cl_queue_family_properties_intel)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_queue_family_properties_intel>())).properties as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_queue_family_properties_intel),
                "::",
                stringify!(properties)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_queue_family_properties_intel>())).capabilities
                    as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_queue_family_properties_intel),
                "::",
                stringify!(capabilities)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_queue_family_properties_intel>())).count as *const _
                    as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_queue_family_properties_intel),
                "::",
                stringify!(count)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<cl_queue_family_properties_intel>())).name as *const _
                    as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(cl_queue_family_properties_intel),
                "::",
                stringify!(name)
            )
        );
    }
}
